
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/koyashiro/infra/actions/runs/8725929242)



<pre><code>Apply complete! Resources: 13 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_blog will be created
  + resource "cloudflare_record" "cname_blog" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "blog"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "blog-koyashiro.pages.dev"
      + zone_id         = "***"
    }

  # cloudflare_record.cname_cdn will be created
  + resource "cloudflare_record" "cname_cdn" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cdn"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "cdn-koyashiro.pages.dev"
      + zone_id         = "***"
    }

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "koyashiro.pages.dev"
      + zone_id         = "***"
    }

  # cloudflare_record.mx_alt1 will be created
  + resource "cloudflare_record" "mx_alt1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "***"
    }

  # cloudflare_record.mx_alt2 will be created
  + resource "cloudflare_record" "mx_alt2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "***"
    }

  # cloudflare_record.mx_alt3 will be created
  + resource "cloudflare_record" "mx_alt3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "***"
    }

  # cloudflare_record.mx_alt4 will be created
  + resource "cloudflare_record" "mx_alt4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "***"
    }

  # cloudflare_record.mx_primary will be created
  + resource "cloudflare_record" "mx_primary" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "***"
    }

  # cloudflare_record.txt_discord will be created
  + resource "cloudflare_record" "txt_discord" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_discord"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "dh=f083205940112e59edc7561488d3867f414384a3"
      + zone_id         = "***"
    }

  # cloudflare_record.txt_google_domainkey will be created
  + resource "cloudflare_record" "txt_google_domainkey" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAsN9es+6C1V6MGC8Scg/nHQOEd9rtNraw6hqX6gi24F3i8hAVtlDC2FrSukqUz8HH1WEdaGxPir2yvE8xD7OxIT4uOUinb7eXY5CaCRJL9lpjj82FBcVOkiXcuTEFHu04kkHSo3fuLCl8OHrTup8HUqPJ2VwUiCeOkqjoy7Hv9VZDQmwjPbRyVncjVb/sDtVeY2bVUix1acSo/g5mIrbcw2xWrxCU/VWcEfOvQypfE+z9UfBpbeAGWArBD+l3+vLAWFb3dsMc4CvRa3mGY8kehOMTHnaaf2gO5k7afAkSil/zK580WLHG0Hq6rEG9tsawydVbrkCqRRsV9yAWhyI02QIDAQAB"
      + zone_id         = "***"
    }

  # cloudflare_record.txt_google_suite_verification will be created
  + resource "cloudflare_record" "txt_google_suite_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "google-site-verification=IXe9IiyOUytKAH9R0_KVE2Vmpt1iOB8kqwtSf-F4304"
      + zone_id         = "***"
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "keybase-site-verification=h6nNjeIuG_eU4fByG3qFMwbC8-sUeC5pvpD_m5iIUh4"
      + zone_id         = "***"
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=spf1 include:koyashi.ro ~all"
      + zone_id         = "***"
    }

Plan: 13 to add, 0 to change, 0 to destroy.
cloudflare_record.txt_spf: Creating...
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.cname_cdn: Creating...
cloudflare_record.txt_discord: Creating...
cloudflare_record.cname_blog: Creating...
cloudflare_record.txt_google_domainkey: Creating...
cloudflare_record.mx_alt4: Creating...
cloudflare_record.mx_alt1: Creating...
cloudflare_record.mx_alt2: Creating...
cloudflare_record.mx_alt3: Creating...
cloudflare_record.txt_discord: Creation complete after 2s [id=14eb5ef06ac31307e081d3f550804167]
cloudflare_record.cname_root: Creating...
cloudflare_record.txt_spf: Creation complete after 3s [id=fb4fafabb68d9df8c88c66ef5de27dca]
cloudflare_record.txt_google_suite_verification: Creating...
cloudflare_record.cname_cdn: Creation complete after 3s [id=c4ed764d9bb89337db0ba36849d212bf]
cloudflare_record.mx_primary: Creating...
cloudflare_record.txt_keybase_site_verification: Creation complete after 3s [id=9511901ba761348897d7e8cf1a45228c]
cloudflare_record.mx_alt4: Creation complete after 3s [id=440de8265d7b3c0bdb0cb96e371f900c]
cloudflare_record.cname_blog: Creation complete after 4s [id=dea0937bfa348d1be822f9566bc48e5e]
cloudflare_record.mx_alt3: Creation complete after 4s [id=1688eab5753830f72c89aa00be2eaf80]
cloudflare_record.txt_google_domainkey: Creation complete after 4s [id=eff8125b84f9c478353500ce66c27e9c]
cloudflare_record.mx_alt1: Creation complete after 4s [id=212467857bb840bd60a9046d9ed37300]
cloudflare_record.mx_alt2: Creation complete after 5s [id=445e5385cf8b0df3539bb30ec02bdbe0]
cloudflare_record.cname_root: Creation complete after 4s [id=a536905611e54f3561a1a4803c47ec30]
cloudflare_record.txt_google_suite_verification: Creation complete after 3s [id=915ad97f62a8586238c3c2d7511973f9]
cloudflare_record.mx_primary: Creation complete after 3s [id=255d37959633b15298e109355c0ea57b]

Apply complete! Resources: 13 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":144,"Program":"tfcmt","SHA1":"9fc90f48f314cdc1876151feb5f57dca4c44d7d1","Vars":{},"WorkflowName":"terraform"} -->